/*==============================================================================

   マップ管理[map.h]
														 Author :	歐 改造 古市
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#ifndef MAP_H_
#define MAP_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//↓は絶対にいじらないこと！
#define VIEW_SCREEN_WIDTH	(16.0f)		// 表示範囲(横)
#define VIEW_SCREEN_HEIGHT	(9.0f)		// 表示範囲(縦)

// α版マップ
#define MAP_X				(24.0f)		// マップの横のマス数
#define MAP_Y				(18.0f)		// マップの縦のマス数

// それ以降のマップ


//マップ構造体
typedef struct
{
	float		u = 0.0f;
	float		v = 0.0f;
	float		uh = 0.0f;
	float		vh = 0.0f;
}MAP;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitMap	(void);
void UninitMap	(void);
void UpdateMap	(void);
void DrawMap	(void);
void ChangeUv   (void);
void CameraControl(void);
#endif //MAP_H_
